# 如果一个数是2的n次幂，那么，这个数换算成二进制，一定是最左边是1，其他位是0的形式
# 比如4，它的二进制是100，8的二进制是1000
# n-1的二进制，一定是n的每一位取反，也就是1变成0，0变成1
# 比如7的二进制是0111，3的二进制是011



# 8 = 1000 
# 7 = 0111
# 8&(8−1)=0
   

# 9 = 1001
# 8 = 1000
# 9&(9−1)=8 != 0


# & 是 按位与运算（bitwise AND）
# 把两个整数转成 二进制，然后逐位做 AND


# n & 1 
# 等价于 n % 2
# 判断奇偶

## 这两个数在二进制上重叠的1的个数
# 5 & 3 = 1
# 5 = 101
# 3 = 011
# 001 = 1

class Solution:
    def isPowerOfTwo(self, n: int) -> bool:
        return n > 0 and (n & (n - 1)) == 0
    
class Solution:
    def isPowerOfTwo(self, n: int) -> bool:
        return n > 0 and (n & -n) == n
    